src/Documents/ДокументКадровогоЭДО/ДокументКадровогоЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДокументКадровогоЭДО</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйДокумент</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайлПечатнойФормы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДокумента</name>
    <type>
      <types>DefinedType.ОбъектСПечатнымиФормами</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭлектронныйДокумент</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайл</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОснованиеДокумента</name>
    <type>
      <types>DefinedType.ВладелецПрисоединенныхФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗаявкиКабинетСотрудника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>72</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДокумента</name>
    <type>
      <types>EnumRef.КатегорииДокументовКадровогоЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <comment>АПК:58 Краткий перечень сотрудников, включенных в документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержимоеДокумента</name>
    <type>
      <types>EnumRef.СодержимоеДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Внешний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодписанСотрудником</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСписокСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДокументаКадровогоМероприятия</name>
    <type>
      <types>CatalogRef.КодыДокументовКадровыхМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <comment>Расширение файла версии</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматДокументаСоответствуетТребованиям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольнаяТаблица</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПодписания</name>
    <type>
      <types>EnumRef.ВариантыПодписанияДокументовКЭДО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеПодписанты</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ПодписанныеПечатныеФормы/ПодписанныеПечатныеФормы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодписанныеПечатныеФормы</name>
  <resources>
    <name>Оригинал</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Название</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайлПечатнойФормы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПечатнойФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЭлектронныеПодписи/ЭлектронныеПодписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭлектронныеПодписи</name>
  <resources>
    <name>ТребуетсяПроверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипПодписи</name>
    <type>
      <types>EnumRef.ТипыПодписиКриптографии</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействияПоследнейМеткиВремени</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПроверкиПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаПодписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>260</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КомуВыданСертификат</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Отпечаток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПодписьВерна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>УстановившийПодпись</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>ОшибкаПриАвтоматическомПродлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПропуститьПриПродлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПодписи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьМатематическиВерна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаМатематическойПроверкиПодписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаПроверкиДополнительныхАтрибутов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеАтрибутыПровереныВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторРучнойПроверкиДополнительныхАтрибутов</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеРучнойПроверкиДополнительныхАтрибутов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПодписанныйОбъект</name>
    <type>
      <types>DefinedType.ПодписанныйОбъект</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПодписиДокументовКЭДО/ПодписиДокументовКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодписиДокументовКЭДО</name>
  <resources>
    <name>Отпечаток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатСогласования</name>
    <type>
      <types>EnumRef.РезультатыСогласованияБЗК</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ДокументКадровогоЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиПечатныхФормБЗК/НастройкиПечатныхФормБЗК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПечатныхФормБЗК</name>
  <resources>
    <name>СодержимоеДокумента</name>
    <type>
      <types>EnumRef.СодержимоеДокументов</types>
    </type>
  </resources>
  <resources>
    <name>БлокировкаСУсловием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НаСписокСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КодДокументаКадровогоМероприятия</name>
    <type>
      <types>CatalogRef.КодыДокументовКадровыхМероприятий</types>
    </type>
  </resources>
  <resources>
    <name>ВариантПодписания</name>
    <type>
      <types>EnumRef.ВариантыПодписанияДокументовКЭДО</types>
    </type>
  </resources>
  <attributes>
    <name>Предопределенный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательскоеНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПечатнойФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВариантыПодписанияДокументовКЭДО/ВариантыПодписанияДокументовКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыПодписанияДокументовКЭДО</name>
  <enumValues>
    <name>Требуется</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
  <enumValues>
    <name>НеобходимаСобственноручнаяПодпись</name>
  </enumValues>
</mdclass:Enum>

src/Enums/КатегорииДокументовКадровогоЭДО/КатегорииДокументовКадровогоЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииДокументовКадровогоЭДО</name>
  <enumValues>
    <name>РасчетныйЛисток</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеСотрудника</name>
  </enumValues>
  <enumValues>
    <name>КадровыйДокумент</name>
  </enumValues>
  <enumValues>
    <name>СправкаСотруднику</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ДокументКадровогоЭДО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(ВнешниеПодписанты.ФизическоеЛицо, NULL КАК ИСТИНА))
	|	И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.ОпределитьОбъектыСКомандамиОтчетов
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Отчеты.ДокументыКЭДОСОтказами.ДобавитьКомандыФормированияОтчетов(КомандыОтчетов, Параметры);
	Отчеты.ДокументыКЭДОСотрудников.ДобавитьКомандыФормированияОтчетов(КомандыОтчетов, Параметры);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

// Конец СтандартныеПодсистемы.УправлениеДоступом

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	ОписаниеСостава = ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта();
	ОписаниеСостава.ЗаполнятьФизическиеЛицаПоСотрудникам = Ложь;
	ОписаниеСостава.ИспользоватьКраткийСостав = Истина;
	ОписаниеСостава.ИспользоватьОграничениеДоступа = Ложь;
	ОписаниеСостава.ЗаполнятьТабличнуюЧастьФизическиеЛицаДокумента = Ложь;
	
	ЗарплатаКадрыСоставДокументов.ДобавитьОписаниеХраненияСотрудниковФизическихЛиц(
		ОписаниеСостава.ОписаниеХраненияСотрудниковФизическихЛиц,
		"ВнешниеПодписанты",
		"ФизическоеЛицо");
	
	Возврат ОписаниеСостава;
	
КонецФункции

Функция СвойстваДокумента(ЭлектронныйДокумент, Организация, ФизическоеЛицо,
	ОснованиеДокумента = Неопределено, КатегорияДокумента = Неопределено, СодержимоеДокумента = Неопределено,
	КодДокументаКадровогоМероприятия = Неопределено, ФорматДокументаСоответствуетТребованиям = Истина,
	ВариантПодписания = Неопределено) Экспорт
	
	Свойства = Новый Структура(
		"ЭлектронныйДокумент,
		|Организация,
		|ФизическоеЛицо,
		|ОснованиеДокумента,
		|КатегорияДокумента,
		|СодержимоеДокумента,
		|Дата,
		|ИдентификаторДокумента,
		|ИдентификаторЗаявкиКабинетСотрудника,
		|ДополнительныеСвойства,
		|НаСписокСотрудников,
		|Внешний,
		|КодДокументаКадровогоМероприятия,
		|ФорматДокументаСоответствуетТребованиям,
		|ВариантПодписания");
	
	Свойства.ЭлектронныйДокумент				= ЭлектронныйДокумент;
	Свойства.Организация						= Организация;
	Свойства.ФизическоеЛицо						= ФизическоеЛицо;
	Свойства.ОснованиеДокумента					= ОснованиеДокумента;
	Свойства.КатегорияДокумента					= КатегорияДокумента;
	Свойства.СодержимоеДокумента				= СодержимоеДокумента;
	Свойства.НаСписокСотрудников 				= Ложь;
	Свойства.Внешний 							= Ложь;
	Свойства.КодДокументаКадровогоМероприятия 			= КодДокументаКадровогоМероприятия;
	Свойства.ФорматДокументаСоответствуетТребованиям 	= ФорматДокументаСоответствуетТребованиям;
	Если ВариантПодписания = Неопределено Тогда
		Свойства.ВариантПодписания = Перечисления.ВариантыПодписанияДокументовКЭДО.Требуется;
	Иначе
		Свойства.ВариантПодписания = ВариантПодписания;
	КонецЕсли;
	
	Возврат Свойства;
	
КонецФункции

// Добавляет новый документ и возвращает на него ссылку
//
// Параметры:
//	Свойства - Структура, см.ОписаниеСоставаОбъекта
//
// Возвращаемое значение:
//	ДокументСсылка.ДокументКадровогоЭДО
//
Функция Добавить(Свойства) Экспорт
	
	ДокументЭДО = НовыйДокумент(Свойства);
	ДокументЭДО.Записать();
	КадровыйЭДО.ЗарегистрироватьДокументКЭДОКПересчетуСостояний(ДокументЭДО.Ссылка);
	Возврат ДокументЭДО.Ссылка;
	
КонецФункции

// Возвращает вновь созданный, еще не сохраненный объект документа
//
// Параметры:
//	Свойства - Структура, см.ОписаниеСоставаОбъекта
//
// Возвращаемое значение:
//	ДокументОбъект.ДокументКадровогоЭДО
//
Функция НовыйДокумент(Свойства) Экспорт
	
	ДокументЭДО = Документы.ДокументКадровогоЭДО.СоздатьДокумент();
	
	Если ЗначениеЗаполнено(Свойства.Дата) Тогда
		ДокументЭДО.Дата = Свойства.Дата;
	Иначе
		ДокументЭДО.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ДокументЭДО.ЭлектронныйДокумент =	Свойства.ЭлектронныйДокумент;
	ДокументЭДО.Организация =			Свойства.Организация;
	
	Если ТипЗнч(Свойства.ФизическоеЛицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ДокументЭДО.ВнешниеПодписанты.Добавить().ФизическоеЛицо = Свойства.ФизическоеЛицо;
	Иначе
		Для Каждого ФизическоеЛицо Из Свойства.ФизическоеЛицо Цикл
			ДокументЭДО.ВнешниеПодписанты.Добавить().ФизическоеЛицо = ФизическоеЛицо;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Свойства.ОснованиеДокумента) Тогда
		ДокументЭДО.ОснованиеДокумента = Свойства.ОснованиеДокумента;
	Иначе
		СсылкаНового = Документы.ДокументКадровогоЭДО.ПолучитьСсылку();
		ДокументЭДО.ОснованиеДокумента = СсылкаНового;
		ДокументЭДО.ДополнительныеСвойства.Вставить("СсылкаНового", ДокументЭДО.ОснованиеДокумента)
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Свойства.ИдентификаторДокумента) Тогда
		ДокументЭДО.ИдентификаторДокумента = Свойства.ИдентификаторДокумента;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Свойства.ИдентификаторЗаявкиКабинетСотрудника) Тогда
		ДокументЭДО.ИдентификаторЗаявкиКабинетСотрудника = Свойства.ИдентификаторЗаявкиКабинетСотрудника;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Свойства.КатегорияДокумента) Тогда
		КатегорияДокумента = Свойства.КатегорияДокумента;
	Иначе
		Если КадровыйЭДО.ЭтоОбъектСПечатнымиФормами(Свойства.ОснованиеДокумента)
			И ТипЗнч(Свойства.ОснованиеДокумента) <> Тип("ДокументСсылка.СправкаНДФЛ")
			И ТипЗнч(Свойства.ОснованиеДокумента) <> Тип("ДокументСсылка.СведенияОДоходахСотрудникаДляСоцВыплат")
			И Не ЗаявкиСотрудников.ВладелецЗаявкаСотрудника(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Свойства.ОснованиеДокумента)) Тогда
			
			КатегорияДокумента = Перечисления.КатегорииДокументовКадровогоЭДО.КадровыйДокумент;
		Иначе
			КатегорияДокумента = Перечисления.КатегорииДокументовКадровогоЭДО.СправкаСотруднику;
		КонецЕсли;
	КонецЕсли;
	ДокументЭДО.КатегорияДокумента = КатегорияДокумента;
	
	Если ЗначениеЗаполнено(Свойства.СодержимоеДокумента) Тогда
		ДокументЭДО.СодержимоеДокумента = Свойства.СодержимоеДокумента;
	Иначе
		ДокументЭДО.СодержимоеДокумента = КадровыйЭДО.МаксимальноДоступноеСодержимоеДокументовПользователя();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Свойства.ДополнительныеСвойства) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(
			ДокументЭДО.ДополнительныеСвойства, Свойства.ДополнительныеСвойства, Истина);
	КонецЕсли;
	
	ДокументЭДО.НаСписокСотрудников = Свойства.НаСписокСотрудников;
	ДокументЭДО.Внешний				= Свойства.Внешний;
	
	Если ЗначениеЗаполнено(Свойства.КодДокументаКадровогоМероприятия) Тогда
		Если ТипЗнч(Свойства.КодДокументаКадровогоМероприятия) = Тип("Строка") Тогда
			КодДокументаКадровогоМероприятия =
				КадровыйЭДОПовтИсп.СсылкаНаКодДокументаКадровогоМероприятия(Свойства.КодДокументаКадровогоМероприятия);
		Иначе
			КодДокументаКадровогоМероприятия = Свойства.КодДокументаКадровогоМероприятия
		КонецЕсли;
		Если КодДокументаКадровогоМероприятия <> КадровыйЭДОПовтИсп.КодКадровогоДокументаПоУмолчанию() Тогда
			ДокументЭДО.КодДокументаКадровогоМероприятия = КодДокументаКадровогоМероприятия;
		КонецЕсли;
	КонецЕсли;
	
	ДокументЭДО.ФорматДокументаСоответствуетТребованиям = Свойства.ФорматДокументаСоответствуетТребованиям;
	ДокументЭДО.ВариантПодписания = Свойства.ВариантПодписания;
	
	Возврат ДокументЭДО;
	
КонецФункции

Процедура УдалитьДокументыПечатныхФормОбъекта(СсылкаНаОбъект) Экспорт
	
	ФайлыПоОбъектам = КадровыйЭДО.ФайлыПечатныхФормПоОбъектам(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СсылкаНаОбъект), , Истина, Истина);
	
	ФайлыПечатныхФорм = Новый Массив;
	Для Каждого ОписаниеФайловОбъекта Из ФайлыПоОбъектам Цикл
		Для Каждого ОписаниеФайловИдентификатора Из ОписаниеФайловОбъекта.Значение Цикл
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ФайлыПечатныхФорм, ОписаниеФайловИдентификатора.Значение);
		КонецЦикла;
	КонецЦикла;
	
	Если ФайлыПечатныхФорм.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЭлектронныеДокументы", ФайлыПечатныхФорм);
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ДокументКадровогоЭДО.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ДокументКадровогоЭДО КАК ДокументКадровогоЭДО
			|ГДЕ
			|	ДокументКадровогоЭДО.ЭлектронныйДокумент В(&ЭлектронныеДокументы)
			|	И НЕ ДокументКадровогоЭДО.ПометкаУдаления";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектДокумента.ДополнительныеСвойства.Вставить("РазрешенаПометкаУдаления", Истина);
			ОбъектДокумента.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Обновляет ответственного находя связанные ДокументыКадровогоЭДО по основанию документ.
//	Параметры:
//		ОснованиеДокумента - ОпределяемыйТип.ВладелецПрисоединенныхФайлов - ссылка на документ основание;
//		Ответственный - СправочникСсылка.Пользователи - новый ответственный по документу.
Процедура ОбновитьОтветственногоПоОснованиюДокумента(ОснованиеДокумента, Ответственный) Экспорт
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументКадровогоЭДО.Ссылка КАК ДокументКЭДО
	               |ИЗ
	               |	Документ.ДокументКадровогоЭДО КАК ДокументКадровогоЭДО
	               |ГДЕ
	               |	ДокументКадровогоЭДО.ОснованиеДокумента = &ОснованиеДокумента";
	
	Запрос.УстановитьПараметр("ОснованиеДокумента", ОснованиеДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументКЭДО = Выборка.ДокументКЭДО.ПолучитьОбъект();
		ДокументКЭДО.Ответственный = Ответственный;
		ДокументКЭДО.Записать();
	КонецЦикла;
	
КонецПроцедуры

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Отчеты.ДокументыКЭДОСотрудников.ДобавитьКомандуПечати(КомандыПечати);
	
КонецПроцедуры

#КонецОбласти

Процедура ПометитьНаУдалениеДокументыУдаленныхОснований(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ПараметрыОбновления = Неопределено Тогда
		МассивОбновленных = Новый Массив;
	Иначе
		
		Если ПараметрыОбновления.Свойство("МассивОбновленных") Тогда
			МассивОбновленных = ПараметрыОбновления.МассивОбновленных;
		Иначе
			МассивОбновленных = Новый Массив;
			ПараметрыОбновления.Вставить("МассивОбновленных", МассивОбновленных);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбновленных", МассивОбновленных);
	
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ДокументКадровогоЭДО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ДокументКадровогоЭДО КАК ДокументКадровогоЭДО
		|ГДЕ
		|	НЕ ДокументКадровогоЭДО.Ссылка В (&МассивОбновленных)
		|	И НЕ ДокументКадровогоЭДО.ПометкаУдаления
		|	И ДокументКадровогоЭДО.ЭлектронныйДокумент.ПометкаУдаления";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Пока Выборка.Следующий() Цикл
		
		МассивОбновленных.Добавить(Выборка.Ссылка);
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ДокументКадровогоЭДО", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ПометкаУдаления = Истина;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНаличияСведенийОЗарплате(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ПараметрыОбновления = Неопределено Тогда
		МассивОбновленных = Новый Массив;
	Иначе
		
		Если ПараметрыОбновления.Свойство("МассивОбновленных") Тогда
			МассивОбновленных = ПараметрыОбновления.МассивОбновленных;
		Иначе
			МассивОбновленных = Новый Массив;
			ПараметрыОбновления.Вставить("МассивОбновленных", МассивОбновленных);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбновленных", МассивОбновленных);
	
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ДокументКадровогоЭДО.Ссылка КАК Ссылка,
		|	ПодписанныеПечатныеФормы.ИдентификаторПечатнойФормы КАК ИдентификаторПечатнойФормы
		|ИЗ
		|	Документ.ДокументКадровогоЭДО КАК ДокументКадровогоЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПодписанныеПечатныеФормы КАК ПодписанныеПечатныеФормы
		|		ПО ДокументКадровогоЭДО.ЭлектронныйДокумент = ПодписанныеПечатныеФормы.ПрисоединенныйФайл
		|ГДЕ
		|	НЕ ДокументКадровогоЭДО.Ссылка В (&МассивОбновленных)
		|	И ДокументКадровогоЭДО.СодержимоеДокумента = ЗНАЧЕНИЕ(Перечисление.СодержимоеДокументов.ПустаяСсылка)";
	
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Пока Выборка.Следующий() Цикл
		
		МассивОбновленных.Добавить(Выборка.Ссылка);
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ДокументКадровогоЭДО", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.СодержимоеДокумента = КадровыйЭДОВызовСервера.СодержимоеДокументаПечатнойФормы(Выборка.ИдентификаторПечатнойФормы);
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПодписантов(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ПараметрыОбновления = Неопределено Тогда
		МассивОбновленных = Новый Массив;
	Иначе
		
		Если ПараметрыОбновления.Свойство("МассивОбновленных") Тогда
			МассивОбновленных = ПараметрыОбновления.МассивОбновленных;
		Иначе
			МассивОбновленных = Новый Массив;
			ПараметрыОбновления.Вставить("МассивОбновленных", МассивОбновленных);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбновленных", МассивОбновленных);
	
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ДокументКадровогоЭДО.Ссылка КАК Ссылка,
		|	ДокументКадровогоЭДО.Дата КАК Дата,
		|	ДокументКадровогоЭДО.УдалитьФизическоеЛицо КАК УдалитьФизическоеЛицо,
		|	ДокументКадровогоЭДО.УдалитьПодписанСотрудником КАК УдалитьПодписанСотрудником,
		|	МАКСИМУМ(ЭлектронныеПодписи.Отпечаток) КАК Отпечаток,
		|	МАКСИМУМ(ЭлектронныеПодписи.ДатаПодписи) КАК ДатаПодписи
		|ИЗ
		|	Документ.ДокументКадровогоЭДО КАК ДокументКадровогоЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДокументКадровогоЭДО.ВнешниеПодписанты КАК ДокументКадровогоЭДОВнешниеПодписанты
		|		ПО ДокументКадровогоЭДО.Ссылка = ДокументКадровогоЭДОВнешниеПодписанты.Ссылка
		|			И ДокументКадровогоЭДО.УдалитьФизическоеЛицо = ДокументКадровогоЭДОВнешниеПодписанты.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭлектронныеПодписи КАК ЭлектронныеПодписи
		|		ПО ДокументКадровогоЭДО.ЭлектронныйДокумент = ЭлектронныеПодписи.ПодписанныйОбъект
		|			И ((ВЫРАЗИТЬ(ЭлектронныеПодписи.Комментарий КАК СТРОКА(1024))) <> """")
		|ГДЕ
		|	НЕ ДокументКадровогоЭДО.Ссылка В (&МассивОбновленных)
		|	И ДокументКадровогоЭДО.УдалитьФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|	И ДокументКадровогоЭДОВнешниеПодписанты.ФизическоеЛицо ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументКадровогоЭДО.Ссылка,
		|	ДокументКадровогоЭДО.УдалитьФизическоеЛицо,
		|	ДокументКадровогоЭДО.УдалитьПодписанСотрудником,
		|	ДокументКадровогоЭДО.Дата";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Пока Выборка.Следующий() Цикл
		
		МассивОбновленных.Добавить(Выборка.Ссылка);
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("Документ.ДокументКадровогоЭДО");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПодписиДокументовКЭДО");
			ЭлементБлокировки.УстановитьЗначение("Объект", Выборка.Ссылка);
			
			Блокировка.Заблокировать();
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			НоваяСтрока = ДокументОбъект.ВнешниеПодписанты.Добавить();
			НоваяСтрока.ФизическоеЛицо = Выборка.УдалитьФизическоеЛицо;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			
			Если Выборка.УдалитьПодписанСотрудником Тогда
				
				НаборЗаписей = РегистрыСведений.ПодписиДокументовКЭДО.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Объект.Установить(Выборка.Ссылка);
				НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Выборка.УдалитьФизическоеЛицо);
				
				Запись = НаборЗаписей.Добавить();
				Запись.Объект = Выборка.Ссылка;
				Запись.ФизическоеЛицо = Выборка.УдалитьФизическоеЛицо;
				Запись.Отпечаток = Выборка.Отпечаток;
				Если ЗначениеЗаполнено(Выборка.ДатаПодписи) Тогда
					Запись.ДатаПодписи = Выборка.ДатаПодписи;
				Иначе
					Запись.ДатаПодписи = Выборка.Дата;
				КонецЕсли;
				
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
				
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКодыДокументовКадровыхМероприятий(ПараметрыОбновления = Неопределено) Экспорт
	
	ИмяРеквизита = "КодДокументаКадровогоМероприятия_7696640660b0414980c152bb6380949b";
	РеквизитКодДокументаКадровогоМероприятия =
		ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", ИмяРеквизита);
	
	Если Не ЗначениеЗаполнено(РеквизитКодДокументаКадровогоМероприятия) Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если ПараметрыОбновления = Неопределено Тогда
		МассивОбновленных = Новый Массив;
	Иначе
		
		Если ПараметрыОбновления.Свойство("МассивОбновленных") Тогда
			МассивОбновленных = ПараметрыОбновления.МассивОбновленных;
		Иначе
			МассивОбновленных = Новый Массив;
			ПараметрыОбновления.Вставить("МассивОбновленных", МассивОбновленных);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбновленных", МассивОбновленных);
	
	Запрос.УстановитьПараметр("Свойство", РеквизитКодДокументаКадровогоМероприятия);
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ДокументКадровогоЭДОДополнительныеРеквизиты.Ссылка КАК Ссылка,
		|	ДокументКадровогоЭДОДополнительныеРеквизиты.Значение КАК Значение
		|ИЗ
		|	Документ.ДокументКадровогоЭДО.ДополнительныеРеквизиты КАК ДокументКадровогоЭДОДополнительныеРеквизиты
		|ГДЕ
		|	НЕ ДокументКадровогоЭДОДополнительныеРеквизиты.Ссылка В (&МассивОбновленных)
		|	И ДокументКадровогоЭДОДополнительныеРеквизиты.Свойство = &Свойство
		|	И ДокументКадровогоЭДОДополнительныеРеквизиты.Значение <> """"
		|	И ДокументКадровогоЭДОДополнительныеРеквизиты.Ссылка.КодДокументаКадровогоМероприятия = ЗНАЧЕНИЕ(Справочник.КодыДокументовКадровыхМероприятий.ПустаяСсылка)";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Пока Выборка.Следующий() Цикл
		
		МассивОбновленных.Добавить(Выборка.Ссылка);
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("Документ.ДокументКадровогоЭДО");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			
			Блокировка.Заблокировать();
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокументОбъект.КодДокументаКадровогоМероприятия = КадровыйЭДОПовтИсп.СсылкаНаКодДокументаКадровогоМероприятия(Выборка.Значение);
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПеренестиСведенияЭлектронногоДокумента(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ПараметрыОбновления = Неопределено Тогда
		МассивОбновленных = Новый Массив;
	Иначе
		
		Если ПараметрыОбновления.Свойство("МассивОбновленных") Тогда
			МассивОбновленных = ПараметрыОбновления.МассивОбновленных;
		Иначе
			МассивОбновленных = Новый Массив;
			ПараметрыОбновления.Вставить("МассивОбновленных", МассивОбновленных);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбновленных", МассивОбновленных);
	
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ДокументКадровогоЭДО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ДокументКадровогоЭДО КАК ДокументКадровогоЭДО
		|ГДЕ
		|	НЕ ДокументКадровогоЭДО.Ссылка В (&МассивОбновленных)
		|	И (ДокументКадровогоЭДО.ЭлектронныйДокумент = НЕОПРЕДЕЛЕНО
		|				И ДокументКадровогоЭДО.УдалитьЭлектронныйДокумент <> НЕОПРЕДЕЛЕНО
		|			ИЛИ ДокументКадровогоЭДО.ОснованиеДокумента = НЕОПРЕДЕЛЕНО
		|				И ДокументКадровогоЭДО.УдалитьОснованиеДокумента <> НЕОПРЕДЕЛЕНО)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументКадровогоЭДО.Дата УБЫВ";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Пока Выборка.Следующий() Цикл
		
		МассивОбновленных.Добавить(Выборка.Ссылка);
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ДокументКадровогоЭДО", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ЭлектронныйДокумент = ДокументОбъект.УдалитьЭлектронныйДокумент;
		ДокументОбъект.ОснованиеДокумента = ДокументОбъект.УдалитьОснованиеДокумента;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРасширенияЭлектронныхДокументов(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ПараметрыОбновления = Неопределено Тогда
		МассивОбновленных = Новый Массив;
	Иначе
		
		Если ПараметрыОбновления.Свойство("МассивОбновленных") Тогда
			МассивОбновленных = ПараметрыОбновления.МассивОбновленных;
		Иначе
			МассивОбновленных = Новый Массив;
			ПараметрыОбновления.Вставить("МассивОбновленных", МассивОбновленных);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбновленных", МассивОбновленных);
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ДокументКадровогоЭДО.Ссылка КАК Ссылка,
		|	ДокументКадровогоЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент
		|ИЗ
		|	Документ.ДокументКадровогоЭДО КАК ДокументКадровогоЭДО
		|ГДЕ
		|	НЕ ДокументКадровогоЭДО.Ссылка В (&МассивОбновленных)
		|	И ДокументКадровогоЭДО.Расширение = """"
		|	И ДокументКадровогоЭДО.ЭлектронныйДокумент <> НЕОПРЕДЕЛЕНО";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	ТаблицаОбновляемых = Запрос.Выполнить().Выгрузить();
	Если ТаблицаОбновляемых.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	РасширенияДокументов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		ТаблицаОбновляемых.ВыгрузитьКолонку("ЭлектронныйДокумент"), "Расширение");
	Для Каждого ДанныеДокумента Из ТаблицаОбновляемых Цикл
		
		МассивОбновленных.Добавить(ДанныеДокумента.Ссылка);
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ДокументКадровогоЭДО", "Ссылка", ДанныеДокумента.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = ДанныеДокумента.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Расширение = РасширенияДокументов.Получить(ДанныеДокумента.ЭлектронныйДокумент);
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПризнакСоответствияФорматаДокументаТребованиям(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ПараметрыОбновления = Неопределено Тогда
		МассивОбновленных = Новый Массив;
	Иначе
		
		Если ПараметрыОбновления.Свойство("МассивОбновленных") Тогда
			МассивОбновленных = ПараметрыОбновления.МассивОбновленных;
		Иначе
			МассивОбновленных = Новый Массив;
			ПараметрыОбновления.Вставить("МассивОбновленных", МассивОбновленных);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбновленных", МассивОбновленных);
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ДокументКадровогоЭДО.Ссылка КАК Ссылка,
		|	ДокументКадровогоЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент
		|ИЗ
		|	Документ.ДокументКадровогоЭДО КАК ДокументКадровогоЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПодписанныеПечатныеФормы КАК ПодписанныеПечатныеФормы
		|		ПО ДокументКадровогоЭДО.ЭлектронныйДокумент = ПодписанныеПечатныеФормы.ПрисоединенныйФайл
		|ГДЕ
		|	НЕ ДокументКадровогоЭДО.Ссылка В (&МассивОбновленных)
		|	И НЕ ДокументКадровогоЭДО.ФорматДокументаСоответствуетТребованиям";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	ТаблицаОбновляемых = Запрос.Выполнить().Выгрузить();
	Если ТаблицаОбновляемых.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Для Каждого ДанныеДокумента Из ТаблицаОбновляемых Цикл
		
		МассивОбновленных.Добавить(ДанныеДокумента.Ссылка);
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ДокументКадровогоЭДО", "Ссылка", ДанныеДокумента.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = ДанныеДокумента.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ФорматДокументаСоответствуетТребованиям = Истина;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьВариантПодписанияДокументов(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ПараметрыОбновления = Неопределено Тогда
		МассивОбновленных = Новый Массив;
	Иначе
		
		Если ПараметрыОбновления.Свойство("МассивОбновленных") Тогда
			МассивОбновленных = ПараметрыОбновления.МассивОбновленных;
		Иначе
			МассивОбновленных = Новый Массив;
			ПараметрыОбновления.Вставить("МассивОбновленных", МассивОбновленных);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбновленных", МассивОбновленных);
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ДокументКадровогоЭДО.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НастройкиПечатныхФормБЗК.ВариантПодписания, ЗНАЧЕНИЕ(Перечисление.ВариантыПодписанияДокументовКЭДО.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыПодписанияДокументовКЭДО.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыПодписанияДокументовКЭДО.Требуется)
		|		ИНАЧЕ НастройкиПечатныхФормБЗК.ВариантПодписания
		|	КОНЕЦ КАК ВариантПодписания
		|ИЗ
		|	Документ.ДокументКадровогоЭДО КАК ДокументКадровогоЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодписанныеПечатныеФормы КАК ПодписанныеПечатныеФормы
		|		ПО ДокументКадровогоЭДО.ЭлектронныйДокумент = ПодписанныеПечатныеФормы.ПрисоединенныйФайл
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПечатныхФормБЗК КАК НастройкиПечатныхФормБЗК
		|		ПО (ПодписанныеПечатныеФормы.ИдентификаторПечатнойФормы = НастройкиПечатныхФормБЗК.ИдентификаторПечатнойФормы)
		|ГДЕ
		|	НЕ ДокументКадровогоЭДО.Ссылка В (&МассивОбновленных)
		|	И ДокументКадровогоЭДО.ВариантПодписания = ЗНАЧЕНИЕ(Перечисление.ВариантыПодписанияДокументовКЭДО.ПустаяСсылка)";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	ТаблицаОбновляемых = Запрос.Выполнить().Выгрузить();
	Если ТаблицаОбновляемых.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ДокументыКЭДОКПересчетуСостояний = Новый Массив;
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Для Каждого ДанныеДокумента Из ТаблицаОбновляемых Цикл
		
		МассивОбновленных.Добавить(ДанныеДокумента.Ссылка);
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ДокументКадровогоЭДО", "Ссылка", ДанныеДокумента.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = ДанныеДокумента.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ВариантПодписания = ДанныеДокумента.ВариантПодписания;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
		ДокументыКЭДОКПересчетуСостояний.Добавить(ДанныеДокумента.Ссылка);
		
	КонецЦикла;
	
	КадровыйЭДО.ЗарегистрироватьДокументыКЭДОКПересчетуСостояний(ДокументыКЭДОКПересчетуСостояний);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
